get_user_test.yml
config:
  target: 'http://localhost:80/api'
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up 1 minute"
  payload:
    path: "get_user_test_data.csv"
    fields:
      - "username"
  ensure:
    p95: 200
scenarios:
  - name: "Create and get user"
    flow:
    - get:
        url: "/users/{{ username }}"
    - get:
        url: "/users/{{ username }}"